#### Terraform Plan: ✅

<details>
<summary>Show</summary>

```terraform
[command]/home/runner/work/_temp/4951020e-a787-451f-8823-571792af5812/terraform-bin plan
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/tnfhhm-sandbox/runs/run-G6CCCqq3wUfG6zcG

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.ecr_read: Refreshing state... [id=2638309598]
aws_ecr_repository.this: Refreshing state... [id=startup-sample-project]
data.aws_iam_policy_document.ecr_read_write: Refreshing state... [id=2003632156]
aws_ecr_repository_policy.this: Refreshing state... [id=startup-sample-project]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.this will be destroyed
  - resource "aws_ecr_repository" "this" {
      - arn                  = "arn:aws:ecr:ca-central-1:016328607553:repository/startup-sample-project" -> null
      - id                   = "startup-sample-project" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "startup-sample-project" -> null
      - registry_id          = "016328607553" -> null
      - repository_url       = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/startup-sample-project" -> null
      - tags                 = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecr_repository.this["another-ecr"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "another-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.this["startup-sample-project"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "startup-sample-project"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this will be destroyed
  - resource "aws_ecr_repository_policy" "this" {
      - id          = "startup-sample-project" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::813318847992:root",
                              - "arn:aws:iam::287566111173:root",
                              - "arn:aws:iam::102199845405:root",
                            ]
                        }
                      - Sid       = "ECRRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - registry_id = "016328607553" -> null
      - repository  = "startup-sample-project" -> null
    }

  # aws_ecr_repository_policy.this["another-ecr"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::813318847992:root",
                              + "arn:aws:iam::287566111173:root",
                              + "arn:aws:iam::102199845405:root",
                            ]
                        }
                      + Sid       = "ECRRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "another-ecr"
    }

  # aws_ecr_repository_policy.this["startup-sample-project"] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::813318847992:root",
                              + "arn:aws:iam::287566111173:root",
                              + "arn:aws:iam::102199845405:root",
                            ]
                        }
                      + Sid       = "ECRRead"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "startup-sample-project"
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - repository_url  = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/startup-sample-project" -> null
  + repository_urls = [
      + (known after apply),
      + (known after apply),
    ]

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Resources: 0 of 2 estimated
           $0.0/mo +$0.0
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/tnfhhm-sandbox/runs/run-G6CCCqq3wUfG6zcG%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.13.5%0AConfiguring remote state backend...%0AInitializing Terraform configuration...%0ARefreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Adata.aws_iam_policy_document.ecr_read: Refreshing state... [id=2638309598]%0Aaws_ecr_repository.this: Refreshing state... [id=startup-sample-project]%0Adata.aws_iam_policy_document.ecr_read_write: Refreshing state... [id=2003632156]%0Aaws_ecr_repository_policy.this: Refreshing state... [id=startup-sample-project]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.this will be destroyed%0A  - resource "aws_ecr_repository" "this" {%0A      - arn                  = "arn:aws:ecr:ca-central-1:016328607553:repository/startup-sample-project" -> null%0A      - id                   = "startup-sample-project" -> null%0A      - image_tag_mutability = "MUTABLE" -> null%0A      - name                 = "startup-sample-project" -> null%0A      - registry_id          = "016328607553" -> null%0A      - repository_url       = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/startup-sample-project" -> null%0A      - tags                 = {} -> null%0A%0A      - encryption_configuration {%0A          - encryption_type = "AES256" -> null%0A        }%0A%0A      - image_scanning_configuration {%0A          - scan_on_push = true -> null%0A        }%0A    }%0A%0A  # aws_ecr_repository.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "another-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository.this["startup-sample-project"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "startup-sample-project"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository_policy.this will be destroyed%0A  - resource "aws_ecr_repository_policy" "this" {%0A      - id          = "startup-sample-project" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = [%0A                          - "ecr:ListImages",%0A                          - "ecr:GetRepositoryPolicy",%0A                          - "ecr:GetDownloadUrlForLayer",%0A                          - "ecr:GetAuthorizationToken",%0A                          - "ecr:DescribeRepositories",%0A                          - "ecr:DescribeImages",%0A                          - "ecr:BatchGetImage",%0A                          - "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = [%0A                              - "arn:aws:iam::813318847992:root",%0A                              - "arn:aws:iam::287566111173:root",%0A                              - "arn:aws:iam::102199845405:root",%0A                            ]%0A                        }%0A                      - Sid       = "ECRRead"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - registry_id = "016328607553" -> null%0A      - repository  = "startup-sample-project" -> null%0A    }%0A%0A  # aws_ecr_repository_policy.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = [%0A                              + "arn:aws:iam::813318847992:root",%0A                              + "arn:aws:iam::287566111173:root",%0A                              + "arn:aws:iam::102199845405:root",%0A                            ]%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "another-ecr"%0A    }%0A%0A  # aws_ecr_repository_policy.this["startup-sample-project"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = [%0A                              + "arn:aws:iam::813318847992:root",%0A                              + "arn:aws:iam::287566111173:root",%0A                              + "arn:aws:iam::102199845405:root",%0A                            ]%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "startup-sample-project"%0A    }%0A%0APlan: 4 to add, 0 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  - repository_url  = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/startup-sample-project" -> null%0A  + repository_urls = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AWaiting for cost estimate to complete...%0A%0AResources: 0 of 2 estimated%0A           $0.0/mo +$0.0%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/bcgov/tnfhhm-sandbox/runs/run-G6CCCqq3wUfG6zcG%0A%0AWaiting for the plan to start...%0A%0ATerraform v0.13.5%0AConfiguring remote state backend...%0AInitializing Terraform configuration...%0ARefreshing Terraform state in-memory prior to plan...%0AThe refreshed state will be used to calculate this plan, but will not be%0Apersisted to local or remote state storage.%0A%0Adata.aws_iam_policy_document.ecr_read: Refreshing state... [id=2638309598]%0Aaws_ecr_repository.this: Refreshing state... [id=startup-sample-project]%0Adata.aws_iam_policy_document.ecr_read_write: Refreshing state... [id=2003632156]%0Aaws_ecr_repository_policy.this: Refreshing state... [id=startup-sample-project]%0A%0A------------------------------------------------------------------------%0A%0AAn execution plan has been generated and is shown below.%0AResource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecr_repository.this will be destroyed%0A  - resource "aws_ecr_repository" "this" {%0A      - arn                  = "arn:aws:ecr:ca-central-1:016328607553:repository/startup-sample-project" -> null%0A      - id                   = "startup-sample-project" -> null%0A      - image_tag_mutability = "MUTABLE" -> null%0A      - name                 = "startup-sample-project" -> null%0A      - registry_id          = "016328607553" -> null%0A      - repository_url       = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/startup-sample-project" -> null%0A      - tags                 = {} -> null%0A%0A      - encryption_configuration {%0A          - encryption_type = "AES256" -> null%0A        }%0A%0A      - image_scanning_configuration {%0A          - scan_on_push = true -> null%0A        }%0A    }%0A%0A  # aws_ecr_repository.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "another-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository.this["startup-sample-project"] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "startup-sample-project"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecr_repository_policy.this will be destroyed%0A  - resource "aws_ecr_repository_policy" "this" {%0A      - id          = "startup-sample-project" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = [%0A                          - "ecr:ListImages",%0A                          - "ecr:GetRepositoryPolicy",%0A                          - "ecr:GetDownloadUrlForLayer",%0A                          - "ecr:GetAuthorizationToken",%0A                          - "ecr:DescribeRepositories",%0A                          - "ecr:DescribeImages",%0A                          - "ecr:BatchGetImage",%0A                          - "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = [%0A                              - "arn:aws:iam::813318847992:root",%0A                              - "arn:aws:iam::287566111173:root",%0A                              - "arn:aws:iam::102199845405:root",%0A                            ]%0A                        }%0A                      - Sid       = "ECRRead"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - registry_id = "016328607553" -> null%0A      - repository  = "startup-sample-project" -> null%0A    }%0A%0A  # aws_ecr_repository_policy.this["another-ecr"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = [%0A                              + "arn:aws:iam::813318847992:root",%0A                              + "arn:aws:iam::287566111173:root",%0A                              + "arn:aws:iam::102199845405:root",%0A                            ]%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "another-ecr"%0A    }%0A%0A  # aws_ecr_repository_policy.this["startup-sample-project"] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = [%0A                              + "arn:aws:iam::813318847992:root",%0A                              + "arn:aws:iam::287566111173:root",%0A                              + "arn:aws:iam::102199845405:root",%0A                            ]%0A                        }%0A                      + Sid       = "ECRRead"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "startup-sample-project"%0A    }%0A%0APlan: 4 to add, 0 to change, 2 to destroy.%0A%0AChanges to Outputs:%0A  - repository_url  = "016328607553.dkr.ecr.ca-central-1.amazonaws.com/startup-sample-project" -> null%0A  + repository_urls = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A%0A------------------------------------------------------------------------%0A%0ACost estimation:%0A%0AWaiting for cost estimate to complete...%0A%0AResources: 0 of 2 estimated%0A           $0.0/mo +$0.0%0A
::set-output name=stderr::
::set-output name=exitcode::0

```

</details>

*Pusher:* @wrnu, *Action:* [Terraform Plan Sandbox: #5](https://github.com/bcgov/startup-sample-project/actions/runs/665417000)